lvm.org
* TODO rhce > ex300, 20180414

- fdisk
- gdisk, gpt fdisk

#+BEGIN_EXAMPLE
fdisk /dev/vdb
n, 3G
t, 8e
w
partprobe

pvcreate /dev/vdb3
vgcreate vg_p1 /dev/vdb3
lvcreate -n storage -L 3G vg_p1

iscsi stuff

fdisk /dev/sda
n, 1G
t, 83
w
partprobe

mkfs.ext4 /dev/sda1

blkid >> /etc/fstab
vi /etc/fstab
mount -a
#+END_EXAMPLE

* cli

vgscan
vgchange -a y
mount /dev/volumegroup/logicalvolume /mnt/somewhere

* one more thing

- [ ] active?

* DONE lvm with two disk

1. parted --script /dev/sdb mklabel gpt mkpart primary 0% 100% set 1 lvm on
   - 첫번째 디스크에 lvm용도의 partition 생성
2. pvcreate /dev/sdb1 
   - 첫번째 디스크를 pv로 구성
3. parted --script /dev/sdc mklabel gpt mkpart primary 0% 100% set 1 lvm on
   - 두번째 디스크에 lvm용도의 partition 생성
4. pvcreate /dev/sdc1
   - 두번째 디스크를 pv로 구성
5. vgcreate vg /dev/sdb1 /dev/sdb2
   - 두개의 디스크를 vg로 구성
6. lvcreate -n lv_data -l 100%FREE -y vg
   - vg를 lv로 구성
7. mkfs.xfs /dev/mapper/lv_data
   - lv에 파일시스템 생성
8. mkdir /data
   - mount 포인트 생성
9. mount /dev/mapper/lv_data /data
   - mount 진행

