lvm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-04-26 금 08:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3d110e7">1. <span class="todo TODO">TODO</span> rhce &gt; ex300, 20180414</a></li>
<li><a href="#org244f6c9">2. cli</a></li>
<li><a href="#org355b04f">3. one more thing</a></li>
<li><a href="#orge2a4d53">4. <span class="done DONE">DONE</span> lvm with two disk</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3d110e7" class="outline-2">
<h2 id="org3d110e7"><span class="section-number-2">1.</span> <span class="todo TODO">TODO</span> rhce &gt; ex300, 20180414</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>fdisk</li>
<li>gdisk, gpt fdisk</li>
</ul>

<pre class="example" id="org7510240">
fdisk /dev/vdb
n, 3G
t, 8e
w
partprobe

pvcreate /dev/vdb3
vgcreate vg_p1 /dev/vdb3
lvcreate -n storage -L 3G vg_p1

iscsi stuff

fdisk /dev/sda
n, 1G
t, 83
w
partprobe

mkfs.ext4 /dev/sda1

blkid &gt;&gt; /etc/fstab
vi /etc/fstab
mount -a
</pre>
</div>
</div>

<div id="outline-container-org244f6c9" class="outline-2">
<h2 id="org244f6c9"><span class="section-number-2">2.</span> cli</h2>
<div class="outline-text-2" id="text-2">
<p>
vgscan
vgchange -a y
mount /dev/volumegroup/logicalvolume /mnt/somewhere
</p>
</div>
</div>

<div id="outline-container-org355b04f" class="outline-2">
<h2 id="org355b04f"><span class="section-number-2">3.</span> one more thing</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> active?</li>
</ul>
</div>
</div>

<div id="outline-container-orge2a4d53" class="outline-2">
<h2 id="orge2a4d53"><span class="section-number-2">4.</span> <span class="done DONE">DONE</span> lvm with two disk</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>parted &#x2013;script /dev/sdb mklabel gpt mkpart primary 0% 100% set 1 lvm on
<ul class="org-ul">
<li>첫번째 디스크에 lvm용도의 partition 생성</li>
</ul></li>
<li>pvcreate /dev/sdb1 
<ul class="org-ul">
<li>첫번째 디스크를 pv로 구성</li>
</ul></li>
<li>parted &#x2013;script /dev/sdc mklabel gpt mkpart primary 0% 100% set 1 lvm on
<ul class="org-ul">
<li>두번째 디스크에 lvm용도의 partition 생성</li>
</ul></li>
<li>pvcreate /dev/sdc1
<ul class="org-ul">
<li>두번째 디스크를 pv로 구성</li>
</ul></li>
<li>vgcreate vg /dev/sdb1 /dev/sdb2
<ul class="org-ul">
<li>두개의 디스크를 vg로 구성</li>
</ul></li>
<li>lvcreate -n lv<sub>data</sub> -l 100%FREE -y vg
<ul class="org-ul">
<li>vg를 lv로 구성</li>
</ul></li>
<li>mkfs.xfs /dev/mapper/lv<sub>data</sub>
<ul class="org-ul">
<li>lv에 파일시스템 생성</li>
</ul></li>
<li>mkdir /data
<ul class="org-ul">
<li>mount 포인트 생성</li>
</ul></li>
<li>mount /dev/mapper/lv<sub>data</sub> /data
<ul class="org-ul">
<li>mount 진행</li>
</ul></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-04-26 금 08:01</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
